src/cf/Documents/уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС</Name>
			<BasedOn>
				<xr:Item>Document.уатПутевойЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыКонтроляТранспортныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журнал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЖурналыТранспортныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОсмотра</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Требование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТребованияКонтроляТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.уатТипыЗначенийТребованийКонтроляТСиВодителей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Прицепы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыКонтроляТранспортныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыКонтроляТранспортныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предрейсовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Послерейсовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеДанныеСкрыты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позывной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удаление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/уатЖурналПредрейсовогоИПослерейсовогоКонтроляТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Организация   = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ПутевойЛист   = ДанныеЗаполнения.Ссылка;
		ВидКонтроля   = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый;
		ТС            = ПутевойЛист.ТранспортноеСредство; 
		
		Прицепы.Очистить();
		Для Каждого ТекПрицеп Из ПутевойЛист.Прицепы Цикл
			НоваяСтрока = Прицепы.Добавить();
			НоваяСтрока.ТС = ТекПрицеп.ТС;
		КонецЦикла;
	
		СозданныеДокументы = уатЖурналыТранспортныхДокументов.СозданныеДокументыКонтроляТСПоПЛ(ПутевойЛист);
		
		Если СозданныеДокументы.Предрейсовый <> Неопределено И СозданныеДокументы.Послерейсовый = Неопределено Тогда
			ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Послерейсовый;
		КонецЕсли;
				
		ИмяНастройки = "ПриСозданииЖурналаКонтроляТСНаОснованииПЛПодставлятьОтветственного";
		СтруктураНастройки = Новый Структура("Организация, Подразделение", Организация, Подразделение);
		флПроверять = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураНастройки, ИмяНастройки);
		Если флПроверять Тогда 
			Если ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Послерейсовый Тогда
				Контролер = ДанныеЗаполнения.ПринялМеханик;
			Иначе
				Контролер = ДанныеЗаполнения.ВыпустилМеханик;
			КонецЕсли; 
		Иначе
			Пользователь = Пользователи.АвторизованныйПользователь();
			Если ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
				Запрос = Новый Запрос();
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	Сотрудники.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Сотрудники КАК Сотрудники
				|ГДЕ
				|	Сотрудники.ФизическоеЛицо = &Пользователь";
				Запрос.УстановитьПараметр("Пользователь", Пользователь.ФизическоеЛицо);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Контролер = Выборка.Ссылка;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	// проверка на существование уже созданного документа
	Если уатЖурналыТранспортныхДокументов.УжеСозданДокументКонтроляТС(ПутевойЛист, ВидКонтроля, Ссылка) Тогда
		ТекстНСТР = СтрШаблон("Запись журнала %1 контроля ТС для ""%2"" уже создана!",
			?(ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый, "предрейсового", "послерейсового"),
			ПутевойЛист);
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
	КонецЕсли;
	
	// проверка на нарушение минимального интервала ПЛ
	Если НЕ Отказ И ЗначениеЗаполнено(ДатаОсмотра) Тогда
		МинИнтервалПЛ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.МинимальныйИнтервалМеждуПредрейсовымИПослерейсовымОсмотром);
			
		Если МинИнтервалПЛ > 0 Тогда
			ИнтервалПоЖурналу = Неопределено;
			
			СозданныеДокументы = уатЖурналыТранспортныхДокументов.СозданныеДокументыКонтроляТСПоПЛ(ПутевойЛист);
			
			Если ВидКонтроля = Перечисления.уатВидыКонтроляТранспортныхДокументов.Предрейсовый Тогда
				ДокументКонтрольДругой = СозданныеДокументы.Послерейсовый;
				Если ЗначениеЗаполнено(ДокументКонтрольДругой) И ЗначениеЗаполнено(ДокументКонтрольДругой.ДатаОсмотра) Тогда
					ИнтервалПоЖурналу = ДокументКонтрольДругой.ДатаОсмотра - ДатаОсмотра;
					ДатаПредрейсовый  = ДатаОсмотра;
					ДатаПослерейсовый = ДокументКонтрольДругой.ДатаОсмотра;
				КонецЕсли;
			Иначе
				ДокументКонтрольДругой = СозданныеДокументы.Предрейсовый;
				Если ЗначениеЗаполнено(ДокументКонтрольДругой) И ЗначениеЗаполнено(ДокументКонтрольДругой.ДатаОсмотра) Тогда
					ИнтервалПоЖурналу = ДатаОсмотра - ДокументКонтрольДругой.ДатаОсмотра;
					ДатаПредрейсовый  = ДокументКонтрольДругой.ДатаОсмотра;
					ДатаПослерейсовый = ДатаОсмотра;
				КонецЕсли;
			КонецЕсли;
			
			Если ИнтервалПоЖурналу <> Неопределено И ИнтервалПоЖурналу < МинИнтервалПЛ*60 Тогда
				Если НачалоДня(ДатаПредрейсовый) = НачалоДня(ДатаПослерейсовый) Тогда
					ДатаПредрейсовый  = Формат(ДатаПредрейсовый,  "ДФ=HH:mm");
					ДатаПослерейсовый = Формат(ДатаПослерейсовый, "ДФ=HH:mm");
				Иначе
					ДатаПредрейсовый  = Формат(ДатаПредрейсовый,  "ДФ='dd.MM.yyyy HH:mm'");
					ДатаПослерейсовый = Формат(ДатаПослерейсовый, "ДФ='dd.MM.yyyy HH:mm'");
				КонецЕсли;
				
				ТекстНСТР = СтрШаблон(
					"Интервал между предрейсовым и послерейсовым контролем состояния ТС не должен быть меньше %1 минут!
					|Время предрейсового осмотра: %2
					|Время послерейсового осмотра: %3",
					МинИнтервалПЛ, ДатаПредрейсовый, ДатаПослерейсовый);
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ЗначениеЗаполнено(ДатаОсмотра) Тогда
		ДатаОсмотра = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		уатЖурналыТранспортныхДокументов.ИзменитьСостоянияПодписейПЛ(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
	Если Статус = Справочники.уатСтатусы_уэ.Пройдено
		ИЛИ Статус = Справочники.уатСтатусы_уэ.НеПройдено тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОсмотра");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутевойЛист) И ЗначениеЗаполнено(ТС)
		И ТС <> ПутевойЛист.ТранспортноеСредство И ПутевойЛист.Прицепы.Найти(ТС, "ТС") = Неопределено Тогда
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(
		СтрШаблон("ТС ""%1"" отсутствует в указанном Путевом листе!", ТС),
		Отказ, Заголовок);
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура("Организация, Подразделение", Организация, Подразделение);
	флПроверять = НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(СтруктураНастройки, "РазрешитьПодписаниеЖурналаКонтроляТСБезЗаполненияРезультатовОсмотра");
	Если флПроверять Тогда
		ПроверяемыеРеквизиты.Добавить("РезультатыОсмотра");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
